In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
d={'a':[2,3,np.nan],'b':[4,np.nan,np.nan],'c':[5,3,1]}

In [4]:
print(d)

{'a': [2, 3, nan], 'b': [4, nan, nan], 'c': [5, 3, 1]}

In [5]:
df=pd.DataFrame(d)

In [6]:
df

     a    b  c
0  2.0  4.0  5
1  3.0  NaN  3
2  NaN  NaN  1

In [7]:

df.mean()

a    2.5
b    4.0
c    3.0
dtype: float64

In [8]:
df['a']

0    2.0
1    3.0
2    NaN
Name: a, dtype: float64

In [9]:
df.dropna(inplace=True)

In [10]:
df

     a    b  c
0  2.0  4.0  5

In [15]:
df.dropna(axis=1)

   c
0  5
1  3
2  1

In [16]:
df.dropna(axis=0)

     a    b  c
0  2.0  4.0  5

In [17]:
df.fillna(20)

      a     b  c
0   2.0   4.0  5
1   3.0  20.0  3
2  20.0  20.0  1

In [18]:
print(df)

     a    b  c
0  2.0  4.0  5
1  3.0  NaN  3
2  NaN  NaN  1

In [19]:
df['a']

0    2.0
1    3.0
2    NaN
Name: a, dtype: float64

In [20]:
type(df['a'])

pandas.core.series.Series

In [21]:
df.a

0    2.0
1    3.0
2    NaN
Name: a, dtype: float64

In [23]:
df.loc[0]

a    2.0
b    4.0
c    5.0
Name: 0, dtype: float64

In [24]:
type(df.loc[0])

pandas.core.series.Series

In [25]:
df['a'].mean()

2.5

In [27]:
df['a'].fillna(df['a'].mean())

0    2.0
1    3.0
2    2.5
Name: a, dtype: float64